---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralFamilyNameKey
source: html/dcad08e4-6dd1-2a5a-d167-dedfc04b3c5a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralFamilyNameKey Property

"Family Name Key"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFamilyNameKey { get; }
```